{
  "Header.Item1": "About me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "Resume.pdf",
  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "I am a recent <span class='bold'>Bachelor of Computer Science graduate (2024) from Monash University</span> with a strong academic record (<span class='bold'>CGPA: 3.87/4.0, WAM: 83.4</span>). My expertise spans <span class='bold'>Angular, React, React Native, HTML, CSS, JavaScript, TypeScript</span>, and other modern front-end technologies. With years of experience in building high-performance, scalable web and mobile applications, I specialize in delivering well-structured code and seamless user experiences. My solid foundation in <span class='bold'>software development, parallel computing, and full-stack development</span>, combined with proficiency in <span class='bold'>DevOps practices and cloud-based version control systems</span>, enables me to contribute effectively to innovative projects while continuously pushing the boundaries of modern development practices.",
  "Banner.ActionBtn": "Get in touch",
  "AboutMe.Title": "About me",
  "AboutMe.Paragraphs": [
    "As a fresh Computer Science graduate, I am passionate about software development, artificial intelligence, and problem-solving. My academic journey has equipped me with a strong foundation in <span class='bold'> full-stack development</span>, <span class='bold'>software engineering</span>, and <span class='bold'>machine learning</span>. Through my coursework and projects, I've gained experience with various technologies ranging from <span class='bold'>Python, Java, and JavaScript</span> to modern frameworks like <span class='bold'>Angular and Springboot</span>. My technical toolkit includes full-stack development with MongoDB and SQL databases, version control with GitHub, and data visualization using Tableau. I've also explored AI applications and machine learning models, enhancing my analytical and problem-solving capabilities.",
    "Being trilingual in English, Chinese (both fluent), and Bahasa Melayu (intermediate), I'm eager to contribute my technical skills and multicultural perspective to innovative development teams that push the boundaries of technology.",
    "Some of the technologies that I have trained and worked on include (but are not limited to):"
  ],
  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "Tec D",
      "Title": "Intern",
      "Date": "Nov 2022 - Jan 2023",
      "Link":"https://www.linkedin.com/company/tec-d-malaysia/posts/?feedView=all",
      "Description": [
    "Supported the Cloud Licensing Sales Team in various sales tasks",
        "Collaborated with team to gather cloud product information",
        "Assisted in preparing sales materials for client meetings",
        "Assisted in tracking sales progress and reports",
        "Conducted market research to identify potential clients",
        "Participated in client meetings, aiding in solution presentations"
      ]
    },
    {
      "Tab": "iFast",
      "Title": "Java, Mobile and Full Stack Developer Intern",
      "Date": "Nov 2023 - Feb 2024",
      "Link":"https://www.ifastcorp.com/ifastcorp/aboutus/index.tpl",
      "Description": [
        "Updated the company intranet with new features and upgraded it to version 2.0 using Angular and Spring Boot.",
        "Contributed to the development and bug fixes of a Live Translation Video Call Chat project for client consultations.",
        "Implemented solutions to store call data and transcripts for future use.",
        "Integrated Microsoft Azure for hosting, real-time translation, and AI functionalities."
      ]
    }
  ],
  "FeatureProjects.Title": "Projects that I've done",
  "FeatureProjects.Label": "Featured Project",
  "FeatureProjects.Projects": [
    {
      "Title": "Functional Reactive Tetris: A Pure FP Implementation with RxJS",
      "Description": "Developed a <span class='bold'>modern Tetris implementation</span> using <span class='bold'>pure functional programming principles</span> and <span class='bold'>reactive streams</span>. The game showcases <span class='bold'>immutable state management</span> and <span class='bold'>Observable-based event handling</span> through RxJS. Features include <span class='bold'>real-time piece movement</span>, <span class='bold'>rotation mechanics</span>, and <span class='bold'>collision detection</span> - all implemented using <span class='bold'>pure functions</span> and <span class='bold'>reactive streams</span>. The architecture demonstrates <span class='bold'>declarative programming</span> principles with <span class='bold'>state transitions</span> managed through <span class='bold'>Observable chains</span> and <span class='bold'>functional composition</span>.",
      "imgs": [
        "assets/images/Tetris/tetrisImage1.png",
        "assets/images/Tetris/tetrisImage2.png",
        "assets/images/Tetris/tetrisImage3.png"

      ],
      "ghLink":"https://github.com/gablim1802/tetrisGame",
      "vercelLink":"https://tetris-game-2aez.vercel.app/",
      "Technologies": ["TypeScript", "RxJS", "HTML5", "Functional Programming"]
    },
    {
      "Title": "POS System",
      "Description": "Built a <span class='bold'>POS e-commerce platform</span> for selling plants with <span class='bold'>Razor API payment gateway integration</span> for <span class='bold'>secure transactions</span>. Features an <span class='bold'>AI-powered Gemini chatbot</span> for product recommendations and <span class='bold'>custom HTML email templates</span> for order confirmations and updates. Includes <span class='bold'>real-time inventory tracking</span>, <span class='bold'>sales analytics</span>, and <span class='bold'>role-based access control</span>, ensuring <span class='bold'>scalability</span> and <span class='bold'>security</span>.",
      "imgs": ["assets/images/POS/image1.png", "assets/images/POS/image2.png","assets/images/POS/image3.png","assets/images/POS/image4.png"],
      "vercelLink":"https://plant-sales.vercel.app/",
      "Technologies": [
        "Angular",
        "Express.js",
        "Node.js",
        "Mongoose",
        "TypeScript"
      ]
    },
    
    {
      "Title": "Youth Labor and Education Visualisation",
      "Description": "Created a <span class='bold'>Tableau visualization</span> to analyze Malaysia's <span class='bold'>youth labor market</span> and <span class='bold'>education trends</span>. Highlights <span class='bold'>gender disparities</span>, <span class='bold'>employment outcomes</span>, and <span class='bold'>education-to-job market relationships</span>. Features <span class='bold'>time-based trends</span> for future predictions and aids <span class='bold'>policymakers</span> and <span class='bold'>young job seekers</span> in making <span class='bold'>data-driven decisions</span>.",
      "imgs": [
        "assets/images/Tableau/image1.png",
        "assets/images/Tableau/image2.png",
        "assets/images/Tableau/image3.png"
      ],
      "vercelLink":"https://public.tableau.com/app/profile/jun.kee.lim/viz/dataVisualisation133207798/Dashboard1?publish=yes",
      "Technologies": [
        "Tableau"
      ]
    },
    {
      "Title": "Malaysian Demographics and Socioeconomic",
      "Description": "Developed an interactive visualization tool to analyze Malaysia's demographics and socioeconomic factors, focusing on <span class='bold'>population distribution</span> and <span class='bold'>income levels</span> across states and districts. Enabled users to explore <span class='bold'>population trends</span> and <span class='bold'>economic disparities</span> through dynamic charts and maps. Designed for policymakers, researchers, and businesses, the tool supports <span class='bold'>data-driven decision-making</span> in resource allocation and regional development.",
      "imgs": [
        "assets/images/vega/image1.png",
        "assets/images/vega/image2.png",
        "assets/images/vega/image3.png"
      ],
      "ghLink": "https://github.com/Lim1802/FIT3179_DATAV2",
      "vercelLink":"https://lim1802.github.io/FIT3179_DATAV2/",
      "Technologies": [
        "Vega Lite",
        "Python"
      ]
    }
  ],
  "OtherProjects.Title": "More personal projects",
  "OtherProjects.Projects": [
    {
      "Title": "My Recipe Book",
      "Description": "Created an app displaying various cuisines, each containing a list of recipes with details on ingredients. Users can add or remove recipes from their favorites, utilizing a combination of Native Stack Navigator and Drawer Navigator for seamless navigation.",
      "ghLink": "https://github.com/HaryAgni/react-native-learnings/tree/main/meals",
      "Technologies": [
        "React Native",
        "JavaScript",
        "Redux",
        "Expo",
        "Native Stack Navigator",
        "Drawer Navigator"
      ]
    },
    {
      "Title": "Translate App",
      "Description": "Built a text translation app using React, enabling real-time language detection and translation through a third-party API with a clean, user-friendly interface.",
      "ghLink": "https://github.com/HaryAgni/translate-app",
      "demoLink": "https://haryagni.github.io/translate-app/",
      "Technologies": ["React", "HTML", "CSS", "JavaScript"]
    },

    {
      "Title": "Expense Tracker",
      "Description": "Created an Expense Tracker app that enables users to add, remove, edit, and fetch expenses, providing insights into their spending. It utilizes an external API built with Firebase for real-time data synchronization.",
      "ghLink": "https://github.com/HaryAgni/react-native-learnings/tree/main/expense-tracker",
      "Technologies": [
        "React Native",
        "JavaScript",
        "Expo",
        "Redux",
        "Firebase"
      ]
    },
    {
      "Title": "Guess My Number",
      "Description": "Developed a simple game called 'Guess My Number' where players input a number, and the app attempts to guess it. Players indicate whether their number is lower or higher than the guessed number, and once the correct guess is made, a game-over screen displays the winning number.",
      "ghLink": "https://github.com/HaryAgni/react-native-learnings/tree/main/guess-my-number",
      "Technologies": ["React Native", "JavaScript", "Expo"]
    }
  ],
  "Contact.Pretitle": "What’s Next",
  "Contact.Title": "Get in touch!",
  "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message.",
  "Contact.Btn": "Say Hello!"
}
